[
  {
    "title": "Why You Need a Website in This Digital Era: word of mouth is not enough you need a website!",
    "slug": "why-your-business-needs-website",
    "excerpt": "Discover why having a professional website is no longer optional but essential for credibility, visibility, and business growth in today’s digital-first world.",
    "date": "August 19, 2025",
    "thumbnail": "website-needs.jpg"
  },
  {
    "title": "Monetizing Your Design Skills in 2025: A step by step guide on making money online.",
    "slug": "monetize-design-skills-2025",
    "excerpt": "From freelancing platforms to digital products and personal branding — explore smart ways to turn your design skills into consistent income streams this year.",
    "date": "August 21, 2025",
    "thumbnail": "monitize-skills.jpg"
  },
  {
  "title": "The Power of Showing Up: Why Consistency is the Secret Weapon for Your Business",
  "slug": "showing-up-for-your-business",
  "excerpt": "Business growth doesn’t happen overnight—it happens by showing up daily with consistency, discipline, and trust. Wanna grow? Read more in this post.",
  "date": "August 25, 2025",
  "thumbnail": "business-growth.jpg"
},
{
  "title": "How to Use AI Tools to Boost Your Business in 2025",
  "slug": "Ai-tools-for-your-business",
  "excerpt": "Discover the best AI tools to save time, cut costs, and grow your business faster in 2025. From automation to customer service, here’s what every entrepreneur needs.",
  "date": "September 14, 2025",
  "thumbnail": "ai-tools-for-business.jpg"
},
{
  "title": "In-Demand Skills in Kenya (2025)",
  "slug": "in-demand-skills-kenya-2025",
  "excerpt": "See the most in-demand skills Kenyan employers are hiring for in 2025 — and how to learn them quickly.",
  "date": "September 14, 2025",
  "thumbnail": "demand-skills.jpg"
},
{
  "title": "Ethical AI & Cybersecurity for Startups",
  "slug": "ethical-ai-cybersecurity-kenya",
  "excerpt": "AI is powerful, but it also comes with risks. Here’s how Kenyan startups can stay secure and ethical while adopting AI.",
  "date": "September 14, 2025",
  "thumbnail": "cyber-sec.jpg"
}

]
